app/controllers/cities_controller.rb

SELECT * FROM "cities"
SELECT * FROM "countries" WHERE ("countries"."id" = 1)
SELECT * FROM "provinces" WHERE ("provinces"."id" = 1)
---
  def index
    @query=OpenStruct.new(params[:query])

    if !params[:query] or !@query.province_id
      @cities = []
      flash[:notice] = "Please enter country and province"
    else

      @cities = City.find :all,
        :include => {:province=>:country},
        :conditions => {:province_id => @query.province_id},
        :order => 'countries.name ASC, provinces.name ASC, cities.name ASC'

SELECT * FROM "cities" WHERE ("cities"."id" = 631)
---
  def show
    @city = City.find(params[:id])

SELECT * FROM "cities" WHERE ("cities"."id" = 8277)
---
  def edit
    @city = City.find(params[:id])