app/controllers/countries_controller.rb

  def index
    @countries = Country.all
---
SELECT * FROM "countries"

  def show
    @country = Country.find(params[:id])
---
SELECT * FROM "countries" WHERE ("countries"."id" = 1)

  def create
    @country = Country.new(params[:country])
    if @country.save
---
INSERT INTO "countries" ("name", "updated_at", "created_at") VALUES('Spain', '2009-08-09 14:52:43', '2009-08-09 14:52:43')