app/controllers/provinces_controller.rb

  def index
    @provinces = Province.all
---
SELECT * FROM "provinces"